package org.dbpedia.extraction.config.dataparser

object EthiopianDateParserConfig {
  val geezNumberDateMap = Map(
    1 -> "፩",
    2 -> "፪",
    3 -> "፫",
    4 -> "፬",
    5 -> "፭",
    6 -> "፮",
    7 -> "፯",
    8 -> "፰",
    9 -> "፱",
    10 -> "፲",
    11 -> "፲፩",
    12 -> "፲፪",
    13 -> "፲፫",
    14 -> "፲፬",
    15 -> "፲፭",
    16 -> "፲፮",
    17 -> "፲፯",
    18 -> "፲፰",
    19 -> "፲፱",
    20 -> "፳",
    21 -> "፳፩",
    22 -> "፳፪",
    23 -> "፳፫",
    24 -> "፳፬",
    25 -> "፳፭",
    26 -> "፳፮",
    27 -> "፳፯",
    28 -> "፳፰",
    29 -> "፳፱",
    30 -> "፴"
  )

  val monthsMap = Map(
    "መስከረም" -> 1,
    "ጥቅምት" -> 2,
    "ኅዳር" -> 3,
    "ታኅሳስ" -> 4,
    "ጥር" -> 5,
    "የካቲት" -> 6,
    "መጋቢት" -> 7,
    "ሚያዝያ" -> 8,
    "ግንቦት" -> 9,
    "ሰኔ" -> 10,
    "ሐምሌ" -> 11,
    "ነሐሴ" -> 12,
    "ጳጉሜ" -> 13
  )

}
